# PyCity Schools Analysis
### Sullivan Shave

In [1]:
import pandas as pd
from pathlib import Path

### Load csv file from resources

In [2]:
school_data = pd.read_csv("schools_complete.csv")
student_data = pd.read_csv("students_complete.csv")

#### School Data (df1)

In [3]:
school_data.head(5)

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
school_data.shape

(15, 5)

In [5]:
df1 = pd.DataFrame(school_data)

In [6]:
df1.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

#### Student Data (df2)

In [7]:
student_data.head(5)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [8]:
student_data.shape

(39170, 7)

In [9]:
df2 = pd.DataFrame(student_data)

In [10]:
df2.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

#### Student_and_School_Data (df)

In [11]:
student_and_school = pd.merge(student_data, school_data, how = "left", on = ["school_name", "school_name"])

In [12]:
student_and_school.head(2)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635

In [13]:
df = pd.DataFrame(student_and_school)

In [14]:
df.head(5)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

## District Summary

In [15]:
# number of schools in the district 

school_count = df["school_name"].nunique()
school_count

15

In [16]:
# number of students in the district

student_count = len(df["Student ID"])
student_count

39170

In [17]:
# total budget among the schools in the district

budget_per_school = df.drop_duplicates(subset=["budget"])
#len(budget_per_school)
total_budget = budget_per_school["budget"].sum()
total_budget

24649428

In [18]:
# average math score in the district (rounded to 2 decimal places)

average_math_score = round(df["math_score"].mean(),2)
average_math_score

78.99

In [19]:
# average reading score in the district (rounded to 2 decimal places)

average_reading_score = round(df["reading_score"].mean(),2)
average_reading_score

81.88

In [20]:
# percentage of students who received a passing grade in math 

students_math_passed = df[(df["math_score"] >= 70)].count()["student_name"]
students_math_passed_percent = round(students_math_passed / float(student_count) * 100, 2)
print(str(students_math_passed_percent) + "%")

74.98%

In [21]:
# percentage of students who received a passing grade in reading

students_reading_passed = df[(df["reading_score"] >= 70)].count()["student_name"]
students_reading_passed_percent = round(students_reading_passed / float(student_count) * 100, 2)
print(str(students_reading_passed_percent) + "%")

85.81%

In [22]:
# percent of students who passed both math AND reading (total percent of students passing)

number_of_students_passing = df[(df["math_score"]>= 70) & \
                                (df["reading_score"] >= 70)].count()["student_name"]
percent_passing_students = round(number_of_students_passing / float(student_count) * 100, 2)
print(str(percent_passing_students) + "%")

65.17%

In [23]:
summary = [{"Total Schools": school_count,\
            "Total Students": student_count,\
            "Total Budget": total_budget,\
            "Average Math Score": average_math_score,\
           "Average Reading Score": average_reading_score,\
           "% Passing Math": students_math_passed_percent,\
           "% Passing English": students_reading_passed_percent,\
           "% Overall Passing": percent_passing_students}]

dfS = pd.DataFrame(summary)
dfS

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing English,% Overall Passing
0,15,39170,24649428,78.99,81.88,74.98,85.81,65.17

## School Summary

In [27]:
# types of schools in the district

school_types = df["type"].unique()
print(school_types)

['District' 'Charter']

In [34]:
# total number of students per school

per_school_counts = df1[["school_name", "size"]]
print(per_school_counts)

              school_name  size
0       Huang High School  2917
1    Figueroa High School  2949
2     Shelton High School  1761
3   Hernandez High School  4635
4     Griffin High School  1468
5      Wilson High School  2283
6     Cabrera High School  1858
7      Bailey High School  4976
8      Holden High School   427
9        Pena High School   962
10     Wright High School  1800
11  Rodriguez High School  3999
12    Johnson High School  4761
13       Ford High School  2739
14     Thomas High School  1635

In [35]:
# total budget per school

per_school_budget = df1[["school_name", "budget"]]
print(per_school_budget)

              school_name   budget
0       Huang High School  1910635
1    Figueroa High School  1884411
2     Shelton High School  1056600
3   Hernandez High School  3022020
4     Griffin High School   917500
5      Wilson High School  1319574
6     Cabrera High School  1081356
7      Bailey High School  3124928
8      Holden High School   248087
9        Pena High School   585858
10     Wright High School  1049400
11  Rodriguez High School  2547363
12    Johnson High School  3094650
13       Ford High School  1763916
14     Thomas High School  1043130

In [42]:
# per capita spending per school

df1["per_capita_spending"] = (df1["budget"] / df1["size"])
df1[["school_name", "per_capita_spending"]]
per_school_capita = print(df1[["school_name", "per_capita_spending"]])
per_school_capita

              school_name  per_capita_spending
0       Huang High School                655.0
1    Figueroa High School                639.0
2     Shelton High School                600.0
3   Hernandez High School                652.0
4     Griffin High School                625.0
5      Wilson High School                578.0
6     Cabrera High School                582.0
7      Bailey High School                628.0
8      Holden High School                581.0
9        Pena High School                609.0
10     Wright High School                583.0
11  Rodriguez High School                637.0
12    Johnson High School                650.0
13       Ford High School                644.0
14     Thomas High School                638.0

In [68]:
df[["school_name", "reading_score", "math_score"]]

              school_name  reading_score  math_score
0       Huang High School             66          79
1       Huang High School             94          61
2       Huang High School             90          60
3       Huang High School             67          58
4       Huang High School             97          84
...                   ...            ...         ...
39165  Thomas High School             99          90
39166  Thomas High School             95          70
39167  Thomas High School             73          84
39168  Thomas High School             99          90
39169  Thomas High School             95          75

[39170 rows x 3 columns]

In [77]:
# average test scores per school

#df[["school_name","reading_score"]].mean()["reading_score"]
Huang_Rd = df[(df["school_name"] == "Huang High School")].mean()["reading_score"]

    # NEED TO FIX

/var/folders/pw/24jcp94x4yv881y296_m1gx80000gn/T/ipykernel_36983/2535310200.py:4: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df[(df["school_name"] == "Huang High School")].mean()["reading_score"]

81.18272197463148

In [98]:
#schools_df = df.copy()
#schools_df.groupby(["school_name"])
#schools_df.head()

    # NOT SURE IF NEEDED

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [99]:
schools_df["reading_score"].mean().groupby(["school_name"])

    # NEED TO FIX

AttributeError: 'numpy.float64' object has no attribute 'groupby'

In [105]:
# Calculate the number of students per school with math scores of 70 or higher

students_passing_math = df[(df["math_score"] >= 70)]
school_students_passing_math = students_passing_math.groupby(["school_name"]).size()

school_students_passing_math

school_name
Bailey High School       3318
Cabrera High School      1749
Figueroa High School     1946
Ford High School         1871
Griffin High School      1371
Hernandez High School    3094
Holden High School        395
Huang High School        1916
Johnson High School      3145
Pena High School          910
Rodriguez High School    2654
Shelton High School      1653
Thomas High School       1525
Wilson High School       2143
Wright High School       1680
dtype: int64

In [ ]:
# Calculate the number of students per school with reading scores of 70 or higher

In [103]:
# the number of students per school that passed both math and reading with scores of 70 or higher

students_passing_math_reading = df[(df["reading_score"] >= 70) & \
                                   (df["math_score"] >= 70)]

school_students_passing_math_reading = students_passing_math_reading \
.groupby(["school_name"]).size()

school_students_passing_math_reading

school_name
Bailey High School       2719
Cabrera High School      1697
Figueroa High School     1569
Ford High School         1487
Griffin High School      1330
Hernandez High School    2481
Holden High School        381
Huang High School        1561
Johnson High School      2549
Pena High School          871
Rodriguez High School    2119
Shelton High School      1583
Thomas High School       1487
Wilson High School       2068
Wright High School       1626
dtype: int64

In [ ]:
# calculating the passing rates

per_school_passing_math = school_students_passing_math / per_school_counts * 100
per_school_passing_reading = school_students_passing_reading / per_school_counts * 100
overall_passing_rate = school_students_passing_math_and_reading / per_school_counts * 100